{ "planet": {
   "name": "Coruscant",
   "rotation_period": "24",
   "orbital_period": "368",
   "diameter": "12240",
   "climate": "temperate",
   "gravity": "1 standard",
   "terrain": "cityscape, mountains",
   "population": "1000000000000",
   "residents": [
      "http://swapi.co/api/people/34/",
      "http://swapi.co/api/people/55/",
      "http://swapi.co/api/people/74/"
   ],
   "films": [
      "http://swapi.co/api/films/5/",
      "http://swapi.co/api/films/4/",
      "http://swapi.co/api/films/6/",
      "http://swapi.co/api/films/3/"
   ],
   "created": "2014-12-10T11:54:13.921000Z",
   "edited": "2014-12-20T20:58:18.432000Z",
   "url": "http://swapi.co/api/planets/9/",
   "desc": [
      "Coruscant /ˈkɒrəsɑːnt/[2] is a planet in the fictional Star Wars universe. It first appeared onscreen in the 1997 Special Edition of Return of the Jedi, but was first mentioned in Timothy Zahn's 1991 novel Heir to the Empire. A city occupying an entire planet, it was renamed Imperial Center during the reign of the Galactic Empire (as depicted in the original films) and Yuuzhan'tar during the Yuuzhan Vong invasion (as depicted in the New Jedi Order novel series). The demonym and adjective form of the planet name is Coruscanti.",
      "Coruscant is, at various times, the capital of the Old Republic, the Galactic Empire, the New Republic, the Yuuzhan Vong Empire and the Galactic Alliance. Not only is Coruscant central to all these governing bodies, it is the navigational center of the galaxy, given that its hyperspace coordinates are (0,0,0). Due to its location and large population, roughly 2 trillion sentients, the galaxy's main trade routes — Perlemian Trade Route, Hydian Way, Corellian Run and Corellian Trade Spine — go through Coruscant, making it the richest and most influential world in the Star Wars galaxy. Coruscant is the sixth planet out of 11 planets in the Coruscant solar system, and has four moons; Centax-1, Centax-2, Centax-3, and Hesperidium.",
      "The Galactic Standard Calendar was the standard measurement of time in the Star Wars galaxy. It centered on the Coruscant tropical year. The Coruscant solar cycle was 368 days long; with a day consisting of 360 NET degrees (or 24 standard hours).[3] Numerous epochs were used to determine calendar eras. The most recent of these calendar eras used the Battle of Yavin (i.e. the destruction of the first Death Star) as its epoch, or \"year zero\": BBY (Before the Battle of Yavin), and ABY (After the Battle of Yavin).[4] The earliest date in the Star Wars expanded universe as a whole is 13,000,000,000 BBY, which serves as the year the universe was created."
   ]
}}
